In [1]:
import pymongo
import pandas as pd

In [2]:
df_1 = pd.DataFrame(
    {
        "Name": ["Gorge", "Felix", "Brandon"],
        "Age": [22, 25, 30],
        "Cool Points": [56, 245, -16]
    }
)

df_2 = pd.DataFrame(
    {
        "Year of Employment": [2010, 2010, 2010, 2011, 2011, 2011, 2012, 2012, 2013],
        "Sallary": [4.53, 4.56, 4.32, 5.21, 5.24, 5.23, 6.22, 7.34, 10.55],
        "Name": ["Gorge", "Felix", "Brandon", "Gorge", "Felix", "Brandon", "Gorge", "Felix", "Gorge"]
    }
)

In [3]:
df_1.head()

      Name  Age  Cool Points
0    Gorge   22           56
1    Felix   25          245
2  Brandon   30          -16

In [4]:
df_2.head()

   Year of Employment  Sallary     Name
0                2010     4.53    Gorge
1                2010     4.56    Felix
2                2010     4.32  Brandon
3                2011     5.21    Gorge
4                2011     5.24    Felix

In [5]:
conn = 'mongodb://localhost:27017'
client = pymongo.MongoClient(conn)
db = client.baseball
collection = db.player_data

In [6]:
db = client.baseball

In [7]:
collection = db.player_data

In [28]:
def mongoize(primary_df, 
             secondary_df, 
             primary_column_to_merge_on, 
             secondary_column_to_merge_on):

    # Create a list to hold dictionaries to insert into the table using insert_many 
    to_insert= []
    # Loop through the primary_df to get the data needed
    for i, row_primary in primary_df.iterrows():
        # Create a dictionary to insert the single entry of data from the primary_df
        new_entry = {}

        # loop through each item of row_primary to imput each value into a key value pair
        for j in range(len(row_primary)):
            # get the column name from the primary_df to use as the Key,
            # and get the associated Value using the same method from the current row
            new_entry[primary_df.columns[j]] = row_primary[primary_df.columns[j]]

        # create an entry to hold the list of data from the Secondary Dataframe
        new_entry["Salary Data"] = []

       # Loop through the secondary_df to get the data needed
        for k, row_secondary in secondary_df.iterrows():
            # Create a dictionary to insert the single entry of data from the secondary_df
            new_sub_entry = {}

            # loop through each item of row_secondary to imput each value into a key value pair
            for l in range(len(row_secondary)):
                found = False
                # get the column name from the secondary_df to use as the Key,
                # and get the associated Value using the same method from the current row
                new_sub_entry[secondary_df.columns[l]] = row_secondary[secondary_df.columns[l]]
                if new_sub_entry[secondary_df.columns[l]] == new_entry[primary_column_to_merge_on]:
                    found = True
                elif found == True and (new_sub_entry[secondary_df.columns[l]] != new_entry[primary_column_to_merge_on]):
                    break
            # merge only the entries that match the current row's Key to merge on
            if new_sub_entry[secondary_column_to_merge_on] == new_entry[primary_column_to_merge_on]:
                # Delete the data that was used to merge from new_sub_entry as it is 
                del new_sub_entry[secondary_column_to_merge_on]
                # add the new_sub_entry to the new_entry
                new_entry["Salary Data"].append(new_sub_entry)

        # add new entry to the list to be inserted
        print(new_entry)
        to_insert.append(new_entry)
    return to_insert

In [29]:
mongoize(df_1, df_2, "Name", "Name")

{'Name': 'Gorge', 'Age': 22, 'Cool Points': 56, 'Salary Data': [{'Year of Employment': 2010, 'Sallary': 4.53}, {'Year of Employment': 2011, 'Sallary': 5.21}, {'Year of Employment': 2012, 'Sallary': 6.22}, {'Year of Employment': 2013, 'Sallary': 10.55}]}
{'Name': 'Felix', 'Age': 25, 'Cool Points': 245, 'Salary Data': [{'Year of Employment': 2010, 'Sallary': 4.56}, {'Year of Employment': 2011, 'Sallary': 5.24}, {'Year of Employment': 2012, 'Sallary': 7.34}]}
{'Name': 'Brandon', 'Age': 30, 'Cool Points': -16, 'Salary Data': [{'Year of Employment': 2010, 'Sallary': 4.32}, {'Year of Employment': 2011, 'Sallary': 5.23}]}

[{'Name': 'Gorge',
  'Age': 22,
  'Cool Points': 56,
  'Salary Data': [{'Year of Employment': 2010, 'Sallary': 4.53},
   {'Year of Employment': 2011, 'Sallary': 5.21},
   {'Year of Employment': 2012, 'Sallary': 6.22},
   {'Year of Employment': 2013, 'Sallary': 10.55}]},
 {'Name': 'Felix',
  'Age': 25,
  'Cool Points': 245,
  'Salary Data': [{'Year of Employment': 2010, 'Sallary': 4.56},
   {'Year of Employment': 2011, 'Sallary': 5.24},
   {'Year of Employment': 2012, 'Sallary': 7.34}]},
 {'Name': 'Brandon',
  'Age': 30,
  'Cool Points': -16,
  'Salary Data': [{'Year of Employment': 2010, 'Sallary': 4.32},
   {'Year of Employment': 2011, 'Sallary': 5.23}]}]

In [ ]:
for i, j in df_1.iterrows():
    print(j)
    for k in j:
        print(k)

In [ ]:
print(df_1)

In [ ]:
test = [c_name for c_name in df_1.columns]
print(test)

In [ ]:
df_1.columns[1]

In [ ]:
collection.insert_many()